---
kind: type
id: T:Autodesk.Revit.DB.AssemblyCodeTable
source: html/07ea4be6-8549-69b1-4744-5d6435abe8e4.htm
---
# Autodesk.Revit.DB.AssemblyCodeTable

AssemblyCodeTable represents the collection of ClassificationEntries for a document.

## Syntax (C#)
```csharp
public class AssemblyCodeTable : KeyBasedTreeEntryTable
```